# Написать цикл для выведения на экран каждой буквы своего ФИО.

fio = 'Dianova Alena Alekseevna'

for x in fio:
    if x != " ":
        print(x)
